In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
from datetime import datetime

In [4]:
s = pd.Series(['a',datetime(2020,10,28),'c',np.nan,None,pd.NaT])
s

0                      a
1    2020-10-28 00:00:00
2                      c
3                    NaN
4                   None
5                    NaT
dtype: object

In [5]:
s

0                      a
1    2020-10-28 00:00:00
2                      c
3                    NaN
4                   None
5                    NaT
dtype: object

In [6]:
s[1] = pd.NaT

In [7]:
s

0       a
1     NaT
2       c
3     NaN
4    None
5     NaT
dtype: object

In [8]:
pd.isnull(s)

0    False
1     True
2    False
3     True
4     True
5     True
dtype: bool

In [9]:
k = pd.DataFrame([[1, 6.5, 3,np.nan], [1, np.nan, np.nan,np.nan],[np.nan, np.nan, np.nan,np.nan], [np.nan, 6.5, 3,np.nan]]) 
k

     0    1    2   3
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [10]:
k[4] = np.nan

In [11]:
k.dropna()

Empty DataFrame
Columns: [0, 1, 2, 3, 4]
Index: []

In [12]:
k.dropna(how = 'any') # 默认行方向,只要有空值就删除

Empty DataFrame
Columns: [0, 1, 2, 3, 4]
Index: []

In [13]:
k.dropna(axis = 0,how = 'all') # 一行都为空才删除

     0    1    2   3   4
0  1.0  6.5  3.0 NaN NaN
1  1.0  NaN  NaN NaN NaN
3  NaN  6.5  3.0 NaN NaN

In [14]:
k.dropna(axis = 1,how='all') # 一列都为空才删除

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
k.fillna(-np.inf)

     0    1    2    3    4
0  1.0  6.5  3.0 -inf -inf
1  1.0 -inf -inf -inf -inf
2 -inf -inf -inf -inf -inf
3 -inf  6.5  3.0 -inf -inf

In [16]:
k

     0    1    2   3   4
0  1.0  6.5  3.0 NaN NaN
1  1.0  NaN  NaN NaN NaN
2  NaN  NaN  NaN NaN NaN
3  NaN  6.5  3.0 NaN NaN

In [17]:
k.fillna({0:0,1:11,2:22,3:33,4:44})
# 指定列填充指定值

     0     1     2     3     4
0  1.0   6.5   3.0  33.0  44.0
1  1.0  11.0  22.0  33.0  44.0
2  0.0  11.0  22.0  33.0  44.0
3  0.0   6.5   3.0  33.0  44.0

In [18]:
k

     0    1    2   3   4
0  1.0  6.5  3.0 NaN NaN
1  1.0  NaN  NaN NaN NaN
2  NaN  NaN  NaN NaN NaN
3  NaN  6.5  3.0 NaN NaN

In [19]:
k.fillna(method = 'ffill') # 前向填充-一般时间格式

     0    1    2   3   4
0  1.0  6.5  3.0 NaN NaN
1  1.0  6.5  3.0 NaN NaN
2  1.0  6.5  3.0 NaN NaN
3  1.0  6.5  3.0 NaN NaN

In [20]:
k.fillna(method = 'bfill') # 后向填充-一般时间格式

     0    1    2   3   4
0  1.0  6.5  3.0 NaN NaN
1  1.0  6.5  3.0 NaN NaN
2  NaN  6.5  3.0 NaN NaN
3  NaN  6.5  3.0 NaN NaN

In [21]:
k.fillna(method = 'ffill',limit = 1)

     0    1    2   3   4
0  1.0  6.5  3.0 NaN NaN
1  1.0  6.5  3.0 NaN NaN
2  1.0  NaN  NaN NaN NaN
3  NaN  6.5  3.0 NaN NaN

In [22]:
k[2].fillna(k[2].mean())

0    3.0
1    3.0
2    3.0
3    3.0
Name: 2, dtype: float64

In [23]:
k

     0    1    2   3   4
0  1.0  6.5  3.0 NaN NaN
1  1.0  NaN  NaN NaN NaN
2  NaN  NaN  NaN NaN NaN
3  NaN  6.5  3.0 NaN NaN

In [24]:
k[[2]].fillna(k[2].median())

     2
0  3.0
1  3.0
2  3.0
3  3.0

In [25]:
k[[2]].fillna(k[2].mean())

     2
0  3.0
1  3.0
2  3.0
3  3.0

In [26]:
k

     0    1    2   3   4
0  1.0  6.5  3.0 NaN NaN
1  1.0  NaN  NaN NaN NaN
2  NaN  NaN  NaN NaN NaN
3  NaN  6.5  3.0 NaN NaN

In [27]:
k.fillna(method = "ffill")

     0    1    2   3   4
0  1.0  6.5  3.0 NaN NaN
1  1.0  6.5  3.0 NaN NaN
2  1.0  6.5  3.0 NaN NaN
3  1.0  6.5  3.0 NaN NaN

In [28]:
k.fillna(method = 'bfill')

     0    1    2   3   4
0  1.0  6.5  3.0 NaN NaN
1  1.0  6.5  3.0 NaN NaN
2  NaN  6.5  3.0 NaN NaN
3  NaN  6.5  3.0 NaN NaN

In [29]:
k.fillna(method = 'ffill',limit = 3)

     0    1    2   3   4
0  1.0  6.5  3.0 NaN NaN
1  1.0  6.5  3.0 NaN NaN
2  1.0  6.5  3.0 NaN NaN
3  1.0  6.5  3.0 NaN NaN

In [30]:
u = pd.DataFrame({'k1':['one','two']* 3 + ['two'],
                  'k2':[1,1,2,3,3,4,4]})

In [31]:
u

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [32]:
u.duplicated() # 都重复才判断

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [33]:
u.drop_duplicates() # 删除重复数据

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [34]:
u.drop_duplicates(subset = ['k1'])
# 只看k1

    k1  k2
0  one   1
1  two   1

In [35]:
u.drop_duplicates(subset = ['k2'])
# 只看k2

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [36]:
u.drop_duplicates(subset = ['k1','k2'])

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [37]:
u.drop_duplicates(subset = ['k1','k2'],
                  keep = 'first')
# 删除重复保留第一个

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [38]:
u.drop_duplicates(subset = ['k1','k2'],
                  keep = 'last')
# 删除重复保留第最后一个

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
6  two   4

In [39]:
u.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [40]:
u.duplicated(subset = ['k1'])

0    False
1    False
2     True
3     True
4     True
5     True
6     True
dtype: bool

In [41]:
u.duplicated(subset = ['k2'])

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [42]:
u.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [43]:
u.drop_duplicates(subset = ['k1'])

    k1  k2
0  one   1
1  two   1

In [44]:
u.drop_duplicates(subset = ['k2'])

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [45]:
u.drop_duplicates(subset = ['k1','k2'])

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [46]:
u.drop_duplicates(subset = ['k1'],keep = 'first')

    k1  k2
0  one   1
1  two   1

In [47]:
u.drop_duplicates(subset = ['k1'],keep = 'last')

    k1  k2
4  one   3
6  two   4

In [48]:
u = pd.DataFrame({'food':['烤肉','猪肉','烤肉','五香熏牛肉','牛肉','烤肉','五香熏牛肉','汉堡','三文鱼'],
                  'weitht':[4,3,12,6,7.5,8,3,5,6]})

In [49]:
u

    food  weitht
0     烤肉     4.0
1     猪肉     3.0
2     烤肉    12.0
3  五香熏牛肉     6.0
4     牛肉     7.5
5     烤肉     8.0
6  五香熏牛肉     3.0
7     汉堡     5.0
8    三文鱼     6.0

In [50]:
dic = {
    '烤肉':'pig',
    '猪肉':'pig',
    '五香熏牛肉':'cow',
    '牛肉':'cow',
    '汉堡':'pig',
    '三文鱼':'salmon'
}

In [51]:
u['animal'] = u['food'].map(dic) # map

In [52]:
u

    food  weitht  animal
0     烤肉     4.0     pig
1     猪肉     3.0     pig
2     烤肉    12.0     pig
3  五香熏牛肉     6.0     cow
4     牛肉     7.5     cow
5     烤肉     8.0     pig
6  五香熏牛肉     3.0     cow
7     汉堡     5.0     pig
8    三文鱼     6.0  salmon

In [53]:
u = pd.DataFrame({'food':['烤肉','猪肉','烤肉','五香熏牛肉','牛肉','烤肉','五香熏牛肉','汉堡','三文鱼'],
                  'weitht':[4,3,12,6,7.5,8,3,5,6]})

In [54]:
u

    food  weitht
0     烤肉     4.0
1     猪肉     3.0
2     烤肉    12.0
3  五香熏牛肉     6.0
4     牛肉     7.5
5     烤肉     8.0
6  五香熏牛肉     3.0
7     汉堡     5.0
8    三文鱼     6.0

In [55]:
def f(s):
    if s in ['烤肉','猪肉','汉堡']:
        return 'pig'
    elif s in ['五香熏牛肉','牛肉']:
        return 'cow'
    elif s in ['三文鱼']:
        return 'salmon'

In [56]:
u['animal'] = u['food'].apply(f) # apply

In [57]:
u

    food  weitht  animal
0     烤肉     4.0     pig
1     猪肉     3.0     pig
2     烤肉    12.0     pig
3  五香熏牛肉     6.0     cow
4     牛肉     7.5     cow
5     烤肉     8.0     pig
6  五香熏牛肉     3.0     cow
7     汉堡     5.0     pig
8    三文鱼     6.0  salmon

In [58]:
u['food'].map(lambda x:x.replace('肉',""))

0       烤
1       猪
2       烤
3    五香熏牛
4       牛
5       烤
6    五香熏牛
7      汉堡
8     三文鱼
Name: food, dtype: object

In [59]:
u

    food  weitht  animal
0     烤肉     4.0     pig
1     猪肉     3.0     pig
2     烤肉    12.0     pig
3  五香熏牛肉     6.0     cow
4     牛肉     7.5     cow
5     烤肉     8.0     pig
6  五香熏牛肉     3.0     cow
7     汉堡     5.0     pig
8    三文鱼     6.0  salmon

In [60]:
u.loc[:,['food','animal']].apply(lambda x: x + "100")

       food     animal
0     烤肉100     pig100
1     猪肉100     pig100
2     烤肉100     pig100
3  五香熏牛肉100     cow100
4     牛肉100     cow100
5     烤肉100     pig100
6  五香熏牛肉100     cow100
7     汉堡100     pig100
8    三文鱼100  salmon100

In [61]:
u.loc[:,['food','animal']].apply(lambda x: x + "100")

       food     animal
0     烤肉100     pig100
1     猪肉100     pig100
2     烤肉100     pig100
3  五香熏牛肉100     cow100
4     牛肉100     cow100
5     烤肉100     pig100
6  五香熏牛肉100     cow100
7     汉堡100     pig100
8    三文鱼100  salmon100

# map单列,apply多列, apply里不能传字典,map里可以传字典

In [62]:
d = pd.Series([1,2,2,2,2,3,3])

In [63]:
d

0    1
1    2
2    2
3    2
4    2
5    3
6    3
dtype: int64

In [64]:
d.replace(2,np.nan)

0    1.0
1    NaN
2    NaN
3    NaN
4    NaN
5    3.0
6    3.0
dtype: float64

In [65]:
df = pd.DataFrame({'a':[1,2,3,2,2,]})

In [66]:
df

   a
0  1
1  2
2  3
3  2
4  2

In [67]:
df.replace(2,np.nan) # 替换

     a
0  1.0
1  NaN
2  3.0
3  NaN
4  NaN

In [68]:
df

   a
0  1
1  2
2  3
3  2
4  2

In [69]:
df.replace([1,2],[1000,np.nan]) # 多值

        a
0  1000.0
1     NaN
2     3.0
3     NaN
4     NaN

In [70]:
df

   a
0  1
1  2
2  3
3  2
4  2

In [71]:
df.replace({1:1000,2:np.nan}) # 字典

        a
0  1000.0
1     NaN
2     3.0
3     NaN
4     NaN